[
  ["host", "<IP | hostname> : usually not needed and determined automatically. For exotic network configuration, network with VPN, specifying the host might be necessary."],
  ["port", "<xxxx> : the port the remote/hub will listen on. Default to 4444."],
  ["cleanupCycle", "<XXXX> in ms. How often a proxy will check for timed out thread."],
  ["timeout", "<XXXX>  the timeout in seconds before the hub automatically ends a test that hasn't had any activity in the last X seconds. The browser will be released for another test to use. This typically takes care of the client crashes."],
  ["browserTimeout", "The timeout in seconds a browser can hang"],
  ["hub", "<http://localhost:4444/grid/register> : the url that will be used to post the registration request. This option takes precedence over -hubHost and -hubPort options."],
  ["hubHost", "<IP | hostname> : the host address of a hub the registration request should be sent to. Default to localhost. Option -hub takes precedence over this option."],
  ["hubPort", "<xxxx> : the port listened by a hub the registration request should be sent to. Default to 4444. Option -hub takes precedence over this option."],
  ["proxy", "the class that will be used to represent the node. By default org.openqa.grid.selenium.proxy.DefaultRemoteProxy."],
  ["maxSession", "max number of tests that can run at the same time on the node, independently of the browser used."],
  ["registerCycle", "how often in ms the node will try to register itself again.Allow to restart the hub without having to restart the nodes."],
  ["nodePolling", "in ms. Interval between alive checks of node how often the hub checks if the node is still alive."],
  ["unregisterIfStillDownAfter", "in ms. If the node remains down for more than unregisterIfStillDownAfter millisec, it will disappear from the hub.Default is 1min."],
  ["downPollingLimit", "node is marked as down after downPollingLimit alive checks."],
  ["nodeStatusCheckTimeout", "in ms. Connection and socket timeout which is used for node alive check."]
]
